Escalation:
	enable
Factory reset
	erase startup-config
	reload (rebuilds configuration)
Config mode
	configure terminal
Change device name
	hostname XXX
Choose line
	line console 0
Choose virtual terminal line
	line vty 0 4
Change (line) password
	password cisco
	login
	exit
Enable password
	enable password cisco
Exit priv mode
	disable
	
Configure interface
	router(config)#interface fastethernet 0
	router(config-if)#ip address 172.18.0.1 255.255.0.0 
	router(config-if)#no shutdown
	router(config-if)#exit
	router(config)#interface serial 0
	router(config-if)#ip address 172.17.0.2 255.255.0.0
	router(config-if)#no shutdown
	router(config-i exit f)#
	
VLAN setup / layer 3 access to switch
	Switch(config)#interface VLAN 1
	Switch(config-if)#ip address 192.168.1.2 255.255.255.0
	Switch(config-if)#no shutdown
	Switch(config-if)#exit
	Switch(config)#ip default-gateway 192.168.1.1
	Switch(config)#exit

Rip routing 	
	router(config)#router rip
	router(config-router)#network 172.17.0.0
	router(config-router)#network 172.18.0.0
	router(config-router)#exit
	router(config)#exit
Manual routing (config)
	ip route 192.168.16.0 255.255.255.0 192.168.15.2
Routing anything to interface
	(config)#ip route 0.0.0.0 0.0.0.0 200.2.2.17

Save config
	copy running-config startup-config

SHOW interface setup (priv)
	show ip interface brief
Show ip route (priv) (rip is optional, shows rip routing)
	sh ip route (rip)
Show current DHCP bindings
	show ip dhcp binding
Show ACLs
	sh access-lists
Show IP to NAT translations
	enabled #show ip nat translations
Show NAT & PAT stats:
	enabled #show ip nat statistics
Show MAC Address Table
	enabled #show mac-address-table
Show MAC Address Table options
Show port security on interface
	(config)#mac-address-table ?
	(config-if)#switchport port-security ?
Show VLAN config
	#show vlan
Show single vlan
	#show vlan name VLAN2
Verify the trunk
	#show interface fastethernet 0/1 switchport
	
Debug ip rip (priv) - shows ip routing info (takes a little to update)
	debug ip rip
Turn debugging off eg
	no debug ip rip events
Turn all debugging off
	undebug all
	
Create DHCP pool
	campus(config)#ip dhcp pool campus
	campus(dhcp-config)#network 172.16.12.0 255.255.255.0
	campus(dhcp-config)#default-router 172.16.12.1
	campus(dhcp-config)#dns-server 172.16.1.2
Excluding addresses from DHCP pool
	#ip dhcp excluded-address 172.16.12.1 172.16.12.11
	
NAT define pool of public addresses
	(config)#ip nat pool public-access 199.99.9.40 199.99.9.62 netmask 255.255.255.224
NAT define nat translation from inside list to outside pool
	(config)#ip nat inside source list 1 pool public-access (overload)
Specify interface inside / outside
	(config)#interface fastethernet 0
	(config-if)#ip nat inside
	(config-if)#interface serial 0
	(config-if)#ip nat outside
Show IP to NAT translations
	enabled #show ip nat translations
Show NAT & PAT stats:
	enabled #show ip nat statistics
	
MAC - Setup a static MAC address
	(config)#mac-address-table static 0001.975d.4925 vlan 1 interface fastethernet 0/4
Show MAC Address Table
	enabled #show mac-address-table
Show MAC Address Table options
	(config)#mac-address-table ?
	
Port - security -Allow the switchport to accept only one device 
	(config-if)#switchport mode access
	(config-if)#switchport port-security
	(config-if)#switchport port-security mac-address sticky
	
Access list
	GAD(config)#access-list 1 deny 192.168.14.0 0.0.0.255
	GAD(config)#access-list 1 permit any
Apply ACL to INT
	GAD(config-if)#ip access-group 1 in
Remove ACL 
	(config-if)#no ip access-group 1 in
Permits pinging host addresses ending in even numbers,
(To check even or odd addresses, we only care that the last bit is a zero or a one.)
	GAD(config)#access-list 2 permit 0.0.0.0 255.255.255.254
Prevent access to HTTP (port 80) from the Ethernet interface hosts
	GAD(config)#access-list 101 deny tcp 192.168.14.0 0.0.0.255 any eq 80
	GAD(config)#access-list 101 permit ip any any
Show ACLs
	show access-lists
	
Using loopback to simulate internet
	GAD(config)#interface loopback0
	GAD(config-if)#ip address 172.16.1.1 255.255.255.0
	GAD(config-if)#exit
	GAD(config)#router rip
	GAD(config-router)#network 172.16.0.0
	GAD(config-if)#^z

VLAN
	Show VLAN config
	#show vlan
Create 2 vlans:
	#vlan database
	(vlan)#vlan 2 name VLAN2
	(vlan)#vlan 3 name VLAN3
	(vlan)#exit
Assigning ports to VLANs 
	#configure terminal
	(config)#interface fastethernet 0/2
	(config-if)#switchport mode access
	(config-if)#switchport access vlan 2
	(config-if)#end
Assign IP to VLAN 1
	(config)#interface vlan 1
	(config-if)#ip address 192.168.1.2 255.255.255.0
	(config-if)#no shutdown
Create the trunk
	(config)#interface fastethernet 0/1
	(config-if)#switchport mode trunk
	[#Depending on version: (config-if)#switchport trunk encapsulation dot1q ]
	(config-if)#end
Verify the trunk
	#show interface fastethernet 0/1 switchport
Delete a Host from a VLAN
	#configure terminal
	(config)#interface fastethernet 0/4
	(config-if)#no switchport access vlan 2
Delete entire VLAN
	#vlan database
	(vlan)#no vlan 3
	Deleting VLAN 3
	(vlan)#exit
Remove the VLAN database info file
	#delete flash:vlan.dat
	Delete filename [vlan.dat]?[Enter]
	Delete flash:vlan.dat? [confirm] [Enter]
Show single vlan
	#show vlan name VLAN2
Configure router for vlan "output" / sub interface
	(config)#interface fastethernet 0/0
	(config-if)#no shutdown
	(config-if)#interface fastethernet 0/0.1
	(config-subif)#encapsulation dot1q 1
	(config-subif)#ip address 192.168.1.1 255.255.255.0
	(config-if)#interface fastethernet 0/0.2
	(config-subif)#encapsulation dot1q 10
	(config-subif)#ip address 192.168.5.1 255.255.255.0
	(config-if)#interface fastethernet 0/0.3
	(config-subif)#encapsulation dot1q 20
	(config-subif)#ip address 192.168.7.1 255.255.255.0
	(config-subif)#end


	
** Configuration reference sheet **

ISP
Router#configure terminal
Router(config)#hostname ISP
ISP(config)#enable password cisco
ISP(config)#enable secret class
ISP(config)#line console 0
ISP(config-line)#password cisco
ISP(config-line)#login
ISP(config-line)#exit
ISP(config)#line vty 0 4
ISP(config-line)#password cisco
ISP(config-line)#login
ISP(config-line)#exit
ISP(config)#interface loopback 0
ISP(config-if)#ip add 172.16.1.1 255.255.255.255
ISP(config-if)#no shutdown
ISP(config-if)#exit
ISP(config)#interface serial 0
ISP(config-if)#ip add 200.2.2.17 255.255.255.252
ISP(config-if)#clock rate 64000
ISP(config)#ip route 199.99.9.32 255.255.255.224 200.2.2.18
ISP(config)#end
ISP#copy running-config startup-config
Destination filename [startup-config]?[Enter]

Gateway
Router#configure terminal
Router(config)#hostname Gateway
Gateway(config)#enable password cisco
Gateway(config)#enable secret class
Gateway(config)#line console 0
Gateway(config-line)#password cisco
Gateway(config-line)#login
Gateway(config-line)#exit
Gateway(config)#line vty 0 4
Gateway(config-line)#password cisco
Gateway(config-line)#login
Gateway(config-line)#exit
Gateway(config)#fastethernet 0
Gateway(config-if)#ip add 10.10.10.1 255.255.255.0
Gateway(config-if)#no shutdown
Gateway(config-if)#exit
Gateway(config)#interface serial 0
Gateway(config-if)#ip add 200.2.2.18 255.255.255.252
Gateway(config-if)#no shutdown
Gateway(config)#ip route 0.0.0.0 0.0.0.0 200.2.2.17
